Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: true if date1 and date2 are in the same day, as defined by the calendar and calendar’s locale; otherwise, false.
ja: true、もしdate1とdate2が、そのカレンダーとカレンダーの持つロケールによる定義どおりに、同じ日の中ならば；そうでなければfalse。

source: true if i has been offset by exactly n steps without going beyond limit; otherwise, false.
ja: iがlimitを越えることなく、ぴったりn幅だけ補われたならばtrue；そうでなければ、falseです。

source: true if lhs is greater than or equal to rhs; otherwise, false.
ja: trueを、lhsがrhsより大きいか等しいならば返します；そうでなければ、false。

source: true if loc lies within range—that is, if it’s greater than or equal to range .location and less than range .location plus range .length.
ja: true、もしlocがrange内に置かれているならば — すなわち、それがrange .locationより大きいか等しいそしてrange .location足すrange .lengthより少ないならば。

source: true if partial String is an acceptable value, otherwise false.
ja: true、もしpartial Stringが受け入れ可能ならば、そうでなければfalse。

source: true if partial String Ptr is acceptable, otherwise false.
ja: true、もしpartial String Ptrが受け入れ可能ならば、そうでなければfalse。

source: true if range1 and range2 have the same locations and lengths.
ja: true、もしrange1とrange2が同じ位置と長さを持つならば。

source: true if table contains a key equal to key, otherwise false.
ja: true、もしtableがkeyと等しいキーを含むならば、そうでなければfalse。

source: true if all changes succeed.
ja: true、もしすべての変更がうまくいったならば。

source: true if a date range could be found, and false if the date is not in a weekend.
ja: ある日付が見つけられたならばtrue、そしてその日付が週末の中にないならばfalse。

source: true if a file at the specified path exists, or false if the file does not exist or its existence could not be determined.
ja: ファイルが指定されたパスで存在するならばtrue、またはファイルが存在しないかそれの実在が明らかにされることができなかったならばfalse。

source: true if a file at the specified path exists, or false if the file’s does not exist or its existence could not be determined.
ja: ファイルが指定されたパスで存在するならばtrue、またはファイルが存在しないまたはそれの実在が明らかにされることができなかったならばfalse。

source: true if file or directory specified in path1 has the same contents as that specified in path2, otherwise false.
ja: true、もしpath1で指定されるファイルまたはディレクトリがpath2で指定されるそれと同じ内容を持つならば、そうでなければfalse。

source: true if successful, otherwise false.
ja: 成功するならばtrue、そうでないならばfalse。

source: true if successful.
ja: 成功するならばtrue。

source: true if the buffer is available, otherwise false.
ja: バッファが利用可能ならばtrue、そうでないならばfalse。

source: true if the bundle was successfully unloaded or was not already loaded; otherwise, false if the bundle could not be unloaded.
ja: true、もしバンドルがうまくアンロードされたまたは今までロードされなかったならば；そうでなければ、false、もしバンドルがアンロードできなかったならば。

source: true if the bundle’s executable code was loaded successfully or was already loaded; otherwise, false if the code could not be loaded.
ja: true、もしバンドルの持つ実行可能コードがうまくロードされたまたは既にロードされたならば；そうでなければ、false、もしコードがロードできなかったならば。

source: true if the conversion from string to cell content object was successful, otherwise false.
ja: true、もし文字列からセル内容への変換が成功したならば、そうでなければfalse。

source: true if the conversion from string was successful; otherwise, false.
ja: true、もし文字列からの変換がうまくいったならば；そうでなければ、false。

source: true if the current process has delete privileges for the file at path; otherwise false if the process does not have delete privileges or the existence of the file could not be determined.
ja: true、もし現在のプロセスがpathでのファイルの特権を削除したならば；そうでなければプロセスが特権を削除しなかったまたはファイルの実在が明らかにできなかったならばfalse。

source: true if the current process has execute privileges for the file at path; otherwise false if the process does not have execute privileges or the existence of the file could not be determined.
ja: true、もし現在のプロセスがpathでのファイルの特権を発効したならば；そうでなければプロセスが特権を発効しなかったまたはファイルの実在が明らかにできなかったならばfalse。

source: true if the current process has read privileges for the file at path; otherwise false if the process does not have read privileges or the existence of the file could not be determined.
ja: true、もし現在のプロセスがpathでのファイルの読み出し特権を持つならば；そうでなければプロセスが読み出し特権を持たなかったまたはファイルの実在が明らかにできなかったならばfalse。

source: true if the current process has write privileges for the file at path; otherwise false if the process does not have write privileges or the existence of the file could not be determined.
ja: true、もし現在のプロセスがpathでのファイルに対する書き込み特権を持つならば；そうでなければプロセスが書き込み特権を持たなかったまたはファイルの実在が明らかにできなかったならばfalse。

source: true if the date matches all of the components, otherwise false.
ja: その日付が構成要素のすべてに合致するならばtrue；そうでなければfalse。

source: true if the directory was created, true if create Intermediates is set and the directory already exists, or false if an error occurred.
ja: ディレクトリが作成されたならばtrue、create Intermediatesが設定されてディレクトリが既に存在するならばtrue、またはエラーが発生するならばfalse。

source: true if the download started successfully or was not necessary, otherwise false.
ja: true、もしダウンロードがうまく始まったまたは必要なかったならば、そうでなければfalse。

source: true if the element was found in the sequence; otherwise, false.
ja: 要素がシーケンスにおいて見つけられなかったならば、true；そうでなければ、false。

source: true if the given date is within a weekend, as defined by the calendar and calendar’s locale; otherwise, false.
ja: true、もし与えられた日付が、そのカレンダーとカレンダーの持つロケールによる定義どおりに、週末内ならば；そうでなければfalse。

source: true if the given date is within today, as defined by the calendar and calendar’s locale; otherwise, false.
ja: true、もし与えられた値が、そのカレンダーとカレンダーの持つロケールによる定義どおりに、今日の内ならば；そうでなければfalse。

source: true if the given date is within tomorrow, as defined by the calendar and calendar’s locale; otherwise, false.
ja: true、もし与えられた値が、そのカレンダーとカレンダーの持つロケールによる定義どおりに、明日の内ならば；そうでなければfalse。

source: true if the given date is within yesterday, as defined by the calendar and calendar’s locale; otherwise, false.
ja: true、もし与えられた日付が、そのカレンダーとカレンダーの持つロケールによる定義どおりに、昨日の内ならば；そうでなければ、false。

source: true if the hard link was created or false if an error occurred.
ja: ハードリンクが作成されたならばtrueまたはエラーが発生したならばfalse。

source: true if the hot spot of the cursor lies inside a given rectangle, otherwise false.
ja: true、カーソルのホットスポットが与えられた矩形の内側に置かれるならば、そうでなければfalse。

source: true if the initial elements of the sequence are equivalent to the elements of possible Prefix; otherwise, false.
ja: シーケンスの冒頭の要素がpossible Prefixの要素と等しいならばtrue；そうでなければfalse。

source: true if the initial elements of the sequence are the same as the elements of possible Prefix; otherwise, false.
ja: シーケンスの冒頭の要素がpossible Prefixの要素と同じならばtrue；そうでなければfalse。

source: true if the item at url was successfully moved to the trash, or false if the item was not moved to the trash.
ja: true、もしurlがうまくゴミ箱に移動されたならば、またはfalse、もし項目がゴミ箱に移動されなかったならば。

source: true if the item is targeted for iCloud storage or false if it is not.
ja: 項目がiCloudストレージに対する対象とされるならばtrueまたはそれがそうでないならばfalse。

source: true if the item should be copied or false if the file manager should stop copying items associated with the current operation.
ja: 項目がコピーされるべきならばtrueまたはファイルマネージャが現在の演算と結び付けられる項目のコピーを中止すべきならばfalse。

source: true if the item should be moved or false if it should not be moved.
ja: 項目が移動されるすべきならばtrueまたはそれが移動されるべきでないならばfalse。

source: true if the item was copied successfully or the file manager’s delegate stopped the operation deliberately.
ja: 項目がうまくコピーされたならば、またはファイルマネージャの持つ委任先が操作を故意に停止したならばtrue。

source: true if the item was moved successfully or the file manager’s delegate stopped the operation deliberately.
ja: 項目がうまく移動されたならば、またはファイルマネージャの持つ委任先が操作を故意に停止したならばtrue。

source: true if the item was removed successfully or if URL was nil.
ja: true、もし項目がうまく除去されたならばまたはURLがnilだったならば。

source: true if the item was removed successfully or if path was nil.
ja: true、もし項目がうまく除去されたならばまたはpathがnilだったならば。

source: true if the item’s status was updated successfully or false if an error occurred.
ja: true、もし項目の状態がうまく更新されたならば、またはfalse、もしエラーが発生したならば。

source: true if the keys and corresponding values of table1 and table2 are the same, and the two tables are the same size, otherwise false.
ja: true、もしキーとtable1およびtable2の対応する値が同じである、そして２つのテーブルのサイズが同じならば、そうでなければfalse。

source: true if the link should be created or false if it should not be created.
ja: リンクが作成されるすべきならばtrueまたはそれが作成されるべきでないならばfalse。

source: true if the local item was removed successfully or false if it was not.
ja: ローカルの項目がうまく除去されたならばtrueまたはそれがそうでなかったならばfalse。

source: true if the nib file was loaded successfully; otherwise, false.
ja: true、もしnibファイルがうまくロードされたならば；そうでなければfalse。

source: true if the operation is successful, otherwise false.
ja: 操作が成功するならばtrue、そうでないならばfalse。

source: true if the operation should proceed or false if it should be aborted.
ja: 操作が続行すべきならばtrueまたはそれが中止されるべきならばfalse。

source: true if the operation should proceed, otherwise false.
ja: 操作を続行すべきならばtrue、そうでないならばfalse。

source: true if the operation was successful or if the item already exists, otherwise false.
ja: 操作が成功したならばまたは項目が既に存在するならばtrue、そうでなければfalse。

source: true if the operation was successful, otherwise false.
ja: 操作が成功したならばtrue、そうでないならばfalse。

source: true if the option set contains member; otherwise, false.
ja: true、もしオプションセットがmemberを含むならば；そうでなければfalse。

source: true if the receiver can create a date by parsing string, otherwise false.
ja: true、もしレシーバがstringを構文解析することによって日付を作成できるならば、そうでなければfalse。

source: true if the receiver generates calendar dates, otherwise false.
ja: true、もしレシーバがカレンダー日付を生成するならば、そうでなければfalse。

source: true if the receiver has been set to use heuristics when parsing a string to guess at the date which is intended, otherwise false.
ja: true、もし意図される日付であると推測するために文字列を構文解析する時に発見的手法を使うようにレシーバが設定されるならば、そうでなければfalse。

source: true if the receiver has bytes available to read, otherwise false.
ja: true、もしレシーバが読み出しに利用可能なバイトを持つならば、そうでなけれぱfalse。

source: true if the receiver should be discarded at the end of the session (regardless of expiration date), otherwise false.
ja: true、もしレシーバがセッションの終わりで（有効期限にかかわらず）廃棄されるべきならば、そうでなければfalse。

source: true if the receiver uses relative date formatting, otherwise false.
ja: true、もしレシーバが相対日付書式設定を使うならば、そうでなけれぱfalse。

source: true if the relationship between the items was successfully determined, or false if an error occurred.
ja: true、もし項目間の関係がうまく決定されたならば、またはfalse、もしエラーが発生したならば。

source: true if the replacement was successful or false if an error occurred.
ja: 置き換えが成功したならばtrueまたはエラーが発生したならばfalse。

source: true if the returned file handle object should take ownership of the file descriptor and close it for you or false if you want to maintain ownership of the file descriptor.
ja: 返されるファイルハンドルオブジェクトがファイル記述子の所有権をとってそれをあなたの代わりに閉じるならばtrue、またはあなたがファイル記述子の所有権を管理したいならばfalse。

source: true if the sequence contains an element that satisfies predicate; otherwise, false.
ja: このシーケンスがpredicate;を満たす要素を含むならばtrue；そうでなければ、false。

source: true if the set has no elements in common with other; otherwise, false.
ja: この集合がotherと共通の要素を持たないならばtrue；そうでなければ、false。

source: true if the set is a strict subset of other; otherwise, false.
ja: この集合がotherの狭義の部分集合ならばtrue；そうでなければ、false。

source: true if the set is a strict superset of other; otherwise, false.
ja: この集合がotherの狭義の上位集合であるならばtrue；そうでなければ、false。

source: true if the set is a subset of other; otherwise, false.
ja: この集合がotherの部分集合ならばtrue；そうでなければ、false。

source: true if the set is a superset of other; otherwise, false.
ja: この集合がotherの上位集合であるならばtrue；そうでなければ、false。

source: true if the specified item should be deleted or false if it should not be deleted.
ja: 指定された項目が削除されるすべきならばtrueまたはそれが削除されるべきでないならばfalse。

source: true if the specified item should be removed or false if it should not be removed.
ja: 指定された項目が除去されるすべきならばtrueまたはそれが除去されるべきでないならばfalse。

source: true if the starting time and duration of a component could be calculated; otherwise, false.
ja: true、もし構成要素の開始時間と継続期間がならば計算できたならば；そうでなければ、false。

source: true if the symbolic link was created or false if an error occurred.
ja: シンボリックリンクが作成されたならばtrueまたはエラーが発生したならばfalse。

source: true if the two dates are equal in the given component and all larger components; otherwise, false.
ja: 与えられた構成要素そして全てのより大きい構成要素において２つの日付が等しいならばtrue；そうでなければ、false。

source: true if the two hash tables are equal—that is, if each element of table1 is in table2 and the two tables are the same size, otherwise false.
ja: true、もし２つのハッシュテーブルが等しいならば — すなわち、table1の要素それぞれがtable2の中にあるそして２つのテーブルが同じサイズならば、そうでなければfalse。

source: true if the two points a Point and b Point are identical, otherwise false.
ja: true、もし２つの点a Pointとb Pointが同一ならば、そうでなければfalse。

source: true if the update is carried out, false if it isn’t needed.
ja: 更新が実施されるならばtrue、それが必要とされないならばfalse。

source: true if this cookie should only be sent over secure channels, otherwise false.
ja: true、もしこのクッキーが安全な経路越しにのみ送られるべきならば、そうでなければfalse。

source: true if this sequence and other contain equivalent items, using are Equivalent as the equivalence test; otherwise, false.
ja: true、このシーケンスとotherがare Equivalentを同等性テストとして使って同じ要素らを含むならば；そうでなければ、false。

source: true if this sequence and other contain the same elements in the same order.
ja: このシーケンスとotherが同じ要素を同じ順序で含んでいるならば、true。

source: true if this sequence precedes other in a dictionary ordering as ordered by are In Increasing Order; otherwise, false.
ja: このシーケンスがotherに、are In Increasing Orderによって並べられる通りのある字典順序において先行するならば、true；そうでなければ、false。

source: true if this sequence precedes other in a dictionary ordering; otherwise, false.
ja: このシーケンスがotherに、ある字典順序において先行するならば、true；そうでなければ、false。

source: true suspends notification delivery, false resumes it.
ja: trueは通知配達を待機します、falseはそれを再開します。

source: true to update the receiver’s filenames (its filename and—for directory file wrappers—the filenames of its sub–file wrappers) be changed to the filenames of the corresponding nodes in the file system, after a successful write operation.
ja: trueで、レシーバの持ついくつかのファイル名（それのファイル名および — ディレクトリファイルラッパーに対して — それの下位ファイルラッパーの名前いくらか）を更新して、ファイルシステムの中の対応するノードの名前に変更されるようにします、成功する書き出し操作の後に。

source: true to write the file safely so that:
ja: ファイルを安全に書き出すにはtrue、それで：

source: true when the contents of the file wrapper match the contents of url, false otherwise.
ja: true、ファイルラッパーの内容がurlの内容と合致する場合は、そうでなければfalse。

source: true when the receiver and host share at least one network address; false otherwise.
ja: true、レシーバとhostが少なくとも１つのネットワークアドレスを共有する場合；そうでなければfalse。

source: true when the write operation is successful, false otherwise.
ja: 書き出し操作が成功である場合はtrue、そうでなければfalse。

source: true when the write operation is successful.
ja: 書き出し操作が成功である場合はtrue。

source: rounding Mode determines how to round it off.
ja: rounding Modeは、どのようにそれを丸めるかを決定します。

source: 0377 is the largest allowed Octal character.
ja: 0377は、最大の許可された８進の文字です。

source: resume(with Suspension ID:) may be invoked in any thread, not just the one in which the corresponding invocation of suspend Current Apple Event() occurred.
ja: resume(with Suspension ID:)は、該当するsuspend Current Apple Event()の発動が起こったものだけでなく、どのスレッドで発動されてもかまいません。

source: NSObject’s implementation returns self.
ja: NSObjectの実装はselfを返します。

source: NSObject’s implementation returns the receiver’s class.
ja: NSObjectの持つ実装はレシーバのクラスを返します。

source: NSObject’s implementation simply returns self.
ja: NSObjectの持つ実装は単にselfを返すだけです。

source: count must be zero or greater.
ja: countは、ゼロまたはより大きくなければなりません。

source: n must not be negative unless the collection conforms to the Bidirectional Collection protocol.
ja: nは、そのコレクションがBidirectional Collectionプロトコルに準拠するのでない限り、負であってはなりません。

source: NSString and NSScanner objects use NSCharacter Set objects to group characters together for searching operations, so that they can find any of a particular set of characters during a search.
ja: NSStringとNSScannerオブジェクトは、NSCharacter Setオブジェクトを使って検索操作用に文字列をグループにまとめます、それによってそれらは特定のひとまとめの文字をいくらでも検索の間に見つけることができます。

source: an Invocation will hold the result, and the runtime system will extract and deliver this result to the original sender.
ja: an Invocationは、結果を保持します、そしてランタイムシステムは、この結果を抜き出して元々の送り手（センダー）に届けます。

source: forward Invocation: can, for example, be used to consolidate code that responds to a variety of different messages, thus avoiding the necessity of having to write a separate method for each selector.
ja: forward Invocation:は、例えば、様々なことなるメッセージに応答するコードを統合するために使われることができます、それによって各セレクタに対して別個のメソッドを書かなければならない必要性を回避します。

source: max Splits must be greater than or equal to zero.
ja: max Splitsは、ゼロより大きいか等しくなければなりません。

source: NSFile HFSCreator Code and NSFile HFSType Code will only be heeded when path specifies a file.
ja: NSFile HFSCreator Code and NSFile HFSType Codeは、pathがファイルを指定する場合に留意されるだけです。

source: rounding Mode specifies the way that number is rounded off.
ja: rounding Modeは、数が丸められる方法を指定します。

source: struct Data will use the class NSData for all operations.
ja: struct Dataは、全ての演算に対してclass NSDataを使います。

source: NSDictionary creates static dictionaries, and NSMutable Dictionary creates dynamic dictionaries.
ja: NSDictionaryは静的な辞書を作成します、そしてNSMutable Dictionaryは動的な辞書を作成します。

source: NSArray creates static arrays, and NSMutable Array creates dynamic arrays.
ja: NSArrayは静的な配列を作成します、そしてNSMutable Arrayは動的な配列を作成します。

source: A|B matches either A or B.
ja: A|Bは、AかBにマッチします。

source: ooo is from one to three octal digits.
ja: oooは、１から３桁までの８進数です。

source: n must be >= 0 and not greater than the number of capture groups.
ja: nは、>= 0で捕獲グループの数より大きくてはなりません。

source: n must be a number ≥ 1 and ≤ total number of capture groups in the pattern.
ja: nは、「≥ 1」そして「≤パターンでの捕獲グループの総数」である数でなければなりません。

source: Destination node. Applicable only to symbolic-link file wrappers.
ja: 行き先ノード。 シンボリックリンクファイルラッパーに対してのみ適用可能です。

source: Directory file wrapper: Represents a directory.
ja: ディレクトリファイルラッパー： ディレクトリを表します。

source: File wrappers. Applicable only to directory file wrappers.
ja: ファイルラッパー。 ディレクトリファイルラッパーに対してのみ適用可能です。

source: Filename. Name of the file system node the file wrapper represents.
ja: ファイル名。 ファイルラッパーが表すファイルシステムノードの名前。

source: Listing 1 shows a sample implementation.
ja: コード出力 1 はサンプル実装を示します。

source: Listing 1 shows how to configure a formatter to create the string “About 5 minutes remaining”.
ja: コード出力 1 は、 “About 5 minutes remaining” を作成するフォーマッタを構成設定する方法を示します。

source: Moving a file into iCloud Specify the location in iCloud at which to store the file or directory.
ja: ファイルをiCloudへ移動する そこでファイルまたはディレクトリが格納されるiCloudでの位置を指定してください。

source: Moving a file out of iCloud Specify the location on the local device.
ja: ファイルをiCloudの外に移動する ローカルデバイス上の位置を指定してください。

source: Notification dispatch table. See “Class at a Glance” > “Principal Attributes” in Notification Center for information about the dispatch table.
ja: Notificationディスパッチテーブル。 “Class at a Glance” > “Principal Attributes” を Notification Center において、ディスパッチテーブルについての情報として見てください。

source: Regular-file contents. Applicable only to regular-file file wrappers.
ja: 通常ファイル内容。 通常ファイルファイルラッパーに対してのみ適用可能です。

source: Regular-file file wrapper: Represents a regular file.
ja: 通常ファイルファイルラッパー： 通常のファイルを表します。

source: Required. Default implementation provided.
ja: 必須。 提供される省略時の実装。

source: Required. Default implementations provided.
ja: 必須。 提供される省略時の実装いくつか。

source: Symbolic-link file wrapper: Represents a symbolic link.
ja: シンボリックリンクファイルラッパー： シンボリックリンクを表します。

source: Table 2 defines the regular expression operators.
ja: 表 2は正規表現演算子を定義します。

source: file-system attributes. See File Manager for information on the contents of the attributes dictionary.
ja: ファイルシステム属性。 File Managerをattributes辞書の内容に関する情報として見てください。

source: = b;\n”, where a and b are the key and value strings returned by the corresponding describe callback functions.
ja: そこにおいてaとbは、対応するdescribeコールバック関数によって返されるキーと値文字列です。

source: A CGPoint typecast from an NSPoint.
ja: NSPointから型キャストされた、CGPoint。

source: A CGRect typecast from an NSRect.
ja: NSRectから型キャストされた、CGRect。

source: A CGSize typecast from an NSSize.
ja: NSSizeから型キャストされたCGSize。

source: A Character Set represents a set of Unicode-compliant characters.
ja: あるCharacter Set表現は、あるユニコード対応文字集合を表します。

source: A Date representing the result of the search, or nil if a result could not be found.
ja: 検索の結果を表現しているDate、または結果が見つけられなかったならばnil。

source: A Date value encapsulate a single point in time, independent of any particular calendrical system or time zone.
ja: Date値は、あらゆる特定のカレンダーシステムまたはタイムゾーンに独立して、ある単一の時点をカプセル化します。

source: A Date Components is not required to define all the component fields.
ja: Date Componentsは、全構成要素単位を定義するのに必須ではありません。

source: A Date Interval, or nil if the date is not in a weekend.
ja: Date Interval、または日付が週末の中にないならばnil。

source: A Date Interval, or nil if the weekend could not be found.
ja: Date Interval、または週末が見つけられなかったならばnil。

source: A Date Interval, or nil if weekends do not exist in the specific calendar or locale.
ja: Date Interval、または指定のカレンダーまたはロケールにおいて週末が存在しないならばnil。

source: A Distributed Notification Center instance broadcasts NSNotification objects to objects in other tasks that have registered for the notification with their task’s default distributed notification center.
ja: Distributed Notification Centerインスタンスは、NSNotificationオブジェクトを他のタスクの中のオブジェクトそれらに対して放送します、それらは、それらのタスクの持つ省略時の分散通知センターを使って、通知に対して登録されます。

source: A Locale.
ja: あるLocale。

source: A Range specifying the location of the found data, or nil if a match could not be found.
ja: 見つかったデータの位置を指定しているRange、または合致が見つけられなかったならばnil。

source: A Reversed Collection instance wraps an underlying collection and provides access to its elements in reverse order.
ja: Reversed Collectionインスタンスは、基礎をなすコレクションをラップして、それの要素へのアクセスを逆順で提供します。

source: A $ not followed by a digit has no special meaning, and will appear in the substitution text as itself, a $.
ja: 桁が続かない$は、特別な意味を持たず、$、それ自身として置換テキストにおいて見えます。

source: A forward Invocation: method might also involve several other objects in the response to a given message, rather than forward it to just one.
ja: forward Invocation:メソッドはまた、指定されたメッセージへの反応として、それをただ１つのものへと転送する代わりに、幾つかの他のオブジェクトを巻き込むこともできます。

source: A descriptor is a data structure that stores data and an accompanying four-character code.
ja: 記述子は、データと付属の４文字コードを格納するデータ構造体です。

source: A subnormal value is a nonzero number that has a lesser magnitude than the smallest normal number.
ja: サブノーマル値は、非ゼロ数で、最も小さいノーマル数よりも少ない規模を持つものです。

source: A Boolean indicating whether non-integer units may be used for values.
ja: 非整数単位が値として使われるかもしれないかどうかを指し示すブール値。

source: A Boolean that specifies whether the current thread blocks until after the specified selector is performed on the receiver on the main thread.
ja: メインスレッドのレシーバで指定されたセレクタが実行される後まで現在のスレッドを封鎖するかどうかを指定するブール。

source: A Boolean that specifies whether the current thread blocks until after the specified selector is performed on the receiver on the specified thread.
ja: 指定されたスレッドのレシーバで指定されたセレクタが実行される後まで現在のスレッドを封鎖するかどうかを指定するブール。

source: A Boolean value indicating whether VoiceOver should group together the elements that are children of the receiver, regardless of their positions on the screen.
ja: VoiceOverが、レシーバの子である要素を、それらの画面上での位置に関係なく一緒にグループにするべきどうかを指し示すブール値。

source: A Boolean value indicating whether VoiceOver should ignore the elements within views that are siblings of the receiver.
ja: VoiceOverが、レシーバの兄弟であるビューの内部の要素を無視するかどうかを指し示すブール値。

source: A Boolean value indicating whether output strings reflect the amount of time remaining.
ja: 出力文字列が残りの時間量を再現するかどうかを指し示すブール値。

source: A Boolean value indicating whether the accessibility elements contained within this accessibility element are hidden.
ja: このアクセシビリティ要素の内部に含まれているアクセシビリティ要素が隠されているかどうかを指し示しているブール値。

source: A Boolean value indicating whether the collection is empty.
ja: コレクションが空かどうかを指し示すブール値。

source: A Boolean value indicating whether the receiver is an accessibility element that an assistive application can access.
ja: レシーバが、補助アプリケーションがアクセスできるアクセシビリティ要素であるかどうかを指し示しているブール値。

source: A Boolean value indicating whether the representation of this decimal is canonical.
ja: この10進数の表現が正準であるかどうかを指し示すブール値。

source: A Boolean value indicating whether the resulting phrase reflects an inexact time value.
ja: 結果の語句が正確でない時間値を再現するかどうかを指し示すブール値。

source: A Boolean value indicating whether this decimal has a negative sign.
ja: この10進数が負符号を持つかどうかを指し示しているブール値。
